### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
 <= read (data resources)

Terraform will perform the following actions:

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

  # module.lambda.aws_lambda_function.this will be destroyed
-   resource "aws_lambda_function" "this" {
-       architectures                  = [
-           "x86_64",
        ] -> null
-       arn                            = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name" -> null
-       filename                       = "dist.zip" -> null
-       function_name                  = "lambda_function_name" -> null
-       handler                        = "dist/lambda" -> null
-       id                             = "lambda_function_name" -> null
-       invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name/invocations" -> null
-       last_modified                  = "2023-08-01T23:54:01.608+0000" -> null
-       layers                         = [] -> null
-       memory_size                    = 128 -> null
-       package_type                   = "Zip" -> null
-       publish                        = false -> null
-       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST" -> null
-       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:lambda_function_name:$LATEST/invocations" -> null
-       reserved_concurrent_executions = -1 -> null
-       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> null
-       runtime                        = "nodejs18.x" -> null
-       skip_destroy                   = false -> null
-       source_code_hash               = "z62MskzEmjQL5by6KnALmCUBjKmLlhoNG718aWGySk4=" -> null
-       source_code_size               = 2125 -> null
-       tags                           = {} -> null
-       tags_all                       = {} -> null
-       timeout                        = 3 -> null
-       version                        = "$LATEST" -> null

-       ephemeral_storage {
-           size = 512 -> null
        }

-       tracing_config {
-           mode = "PassThrough" -> null
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/cataprato-core-lambda"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags_all          = (known after apply)
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "cataprato-core-lambda-logs"
+       name_prefix = (known after apply)
+       path        = "/tf-managed/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "cataprato-core-lambda"
+       name_prefix           = (known after apply)
+       path                  = "/tf-managed/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "cataprato-core-lambda"
    }

  # module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "x86_64",
        ]
+       arn                            = (known after apply)
+       description                    = "Cataprato core"
+       function_name                  = "cataprato-core-lambda"
+       handler                        = "lambda.handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "nodejs18.x"
+       s3_bucket                      = (known after apply)
+       s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       ephemeral_storage {
+           size = 512
        }

+       timeouts {
+           create = "20m"
+           delete = "20m"
+           update = "20m"
        }
    }

  # module.lambda_function.aws_lambda_function_url.this[0] will be created
+   resource "aws_lambda_function_url" "this" {
+       authorization_type = "AWS_IAM"
+       function_arn       = (known after apply)
+       function_name      = "cataprato-core-lambda"
+       function_url       = (known after apply)
+       id                 = (known after apply)
+       invoke_mode        = "RESPONSE_STREAM"
+       url_id             = (known after apply)

+       cors {
+           allow_credentials = true
+           allow_headers     = [
+               "date",
+               "keep-alive",
            ]
+           allow_methods     = [
+               "*",
            ]
+           allow_origins     = [
+               "*",
            ]
+           expose_headers    = [
+               "date",
+               "keep-alive",
            ]
+           max_age           = 86400
        }
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-core-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-core-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/lambda.js",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+           "timestamp" = "1691201599479652000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip"
+           "original_source_code" = "\"./dist/lambda.js\""
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "nodejs18.x",
        ]
+       created_date                = (known after apply)
+       description                 = "Node_modules layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-core-layer-s3"
+       s3_bucket                   = (known after apply)
+       s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist",
+                       null,
                    ],
                ]
+               filename      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+           "timestamp" = "1691201599497041000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip"
+           "original_source_code" = "\"./dist\""
+           "resource_name"        = "aws_lambda_layer_version.this[0]"
+           "resource_type"        = "LAMBDA_LAYER"
+           "source_code_property" = "path"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
+   resource "aws_s3_bucket_versioning" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 21 to add, 0 to change, 1 to destroy.
```
</details>